#ifndef 废话生成器_WORD_HPP
#define 废话生成器_WORD_HPP
#include "FinalLib.hpp"
#include "../CFunction/Func.h"
#include <random>
static random_device Seed;
static mt19937 MT19937(Seed());
using namespace std;
class Word :public ExtractAgent{
public:
    string Extract() override {
        auto WordLib = Information.Lib;
        uniform_int_distribution<int> rd(0, (int) WordLib.size() - 1);
        string result = WordLib.at(rd(MT19937));
        return result;
    }
    //============================================================================
    static Word &Cre(string&& Key,string&& Words){
        auto Build = [&](Word& WordInstance) -> void {
            WordInstance.Information.Key = Key;
            WordInstance.Information.Lib = lysis(Words,'|');
        };
        Word* WordType(new Word);
        Build(*WordType);
        FinalLib::Register(*WordType);
        return *WordType;
    };
};

static auto Say=(Word::Cre("/say","拷问|说|苦诉|大吼|扯着嗓子说|劝告|尖叫|以一百分贝的声音说道|以一千分贝的声音说道|胡言乱语|说梦话道"));

static auto Head=(Word::Cre("/head","诚然|所以|因为|然而|而|即便如此|虽然|但是|一般理性而言|呃呃，我觉得你说的不对，因为|你是正确的，不过考虑到|如果提到这个，就不得不提到|你要是这么说的话，那话可就不能这么说了，我们应该考虑到|毋庸置疑的，这就是问题的关键|我跟你说个典故吧|我们应该考虑到|捏嘛的|我们不妨设想一下这么一种情况|其实|我觉得不一定,你是错误的|我已经说了很多遍了|天呐|我的意思是|是这样的|我个人认为|这些是我们应该考虑到的|难道你就没有考虑过这点|很不可思议吧|呃呃,可是以上观点我一个都不认可|你问为什么|可是你真觉得这句话是对的|这是好的，而且没有一点坏处|难道|典中典,你这种人我见得多了|你真是愚蠢|我跟你说"));

static auto Media=(Word::Cre("/media","不仅|一边|既|也|就"));

static auto Para=(Word::Cre("/para","像|犹如|宛如|如同|不像"));

static auto Adj=(Word::Cre("/adj","巨大|微小|坚硬|柔软|飞快|缓慢|旋转|美丽|寒冷|永恒|烧毁|燃烧|碳色|活泼|静态|强大|弱小|沉底|冰冻|随机|愤怒|高级|悲伤|奢侈|肥胖|红色|橙色|黄色|绿色|蓝色|紫色|黑色|白色|被公认|难以忘怀|印象深刻|铭记于心|母庸置疑|肆无忌惮|难以置信|可笑|没用|愚蠢|机灵|伟大|大方|迷人|恶臭|闷热|细心|老实|暗淡|公共|私有|无效|该死|可怜|无辜|繁忙|厉害|无聊|舒服|高温|凉快|健谈|正方形|铜制|气态|液态|固态|难忘|易碎|危险|复杂|简单|暗淡|刺眼|难以理解|多重|干涸|有创意|害怕|安静|努力|缓慢|无意义|好|坏|正确|错误|整齐|干燥|善良|忍耐|孤独|烦躁|刺鼻|恶心|难视|难听|错漏百出|虚构|可耻|稀奇|古怪|破碎|酒醉|香|转基因|可爱|变异|危险|阴险狡诈|无人问津"));

static auto Noun=(Word::Cre("/noun","我|乌鸦|码头|马桶|钻井|盾构机|负二次方|电视|垃圾桶|手机|酸液|大蒜|窗户|太阳|水枪|山脉|头|地面|氧气|手|铜条|玻璃|马桶|纸巾|行星|神秘|面粉|杯子|风扇|线条|风暴|物流|系数|观点|攻击性|错误|沙发|客厅|家里|地底|太阳|下水道|二次元|你|成绩|壁纸|酒精|洗衣机盖|悲报|背包|清单""预备课程|圆周率|代码的执行原理|钙片|软木|药丸|心脏|梦|下北泽|阴间|小行星|这个|那个|办公室|老家|屁股|实验台|皮肤|手机|电脑|椅子|米桶|热水壶|鲁迅|亚里士多德|喜马拉雅山|图标|物理|化学|颜色|灯条|雪|头像|战争|地区|语言|猫咪|路由器|低位|电平|喜剧|夕阳|飞鸟|蝴蝶|baka|引擎|塑料|速度|水池|红眼果蝇|大肠杆菌|航天楼|八爪鱼|候车大厅|小鹰星云|草履虫|绿头蝇|钢铁战士|热水壶|背包|废物|杂质|吸尘器|雪球|肿瘤|驴子|猫|狗|鞋子|恐龙|圣诞树|傻子|苹果|香蕉|硬盘|温度计|联合国|肥料|粪便|地心|等离子体|烤鸡|牛排|肥皂|猪油|海葵毒素|爆米花|红酒|爆米花|键盘|黑洞|银河系|太阳系|火卫一|肾脏|胰脏|肝脏|大脑|巧克力|神经|柠檬茶|血细胞|剧毒|章鱼|娃娃|心脏|火焰|菜刀|氨水|理智|深渊|混沌|时间|奶油|塑料袋|加湿器|被子|思想|自然|月饼|月球|兔子|牛粪|泥头车|陨石|太空垃圾|宇宙|寿司|火山|板块|岩浆|大海|阿米巴变形虫|奇点|时钟|市镇|概念|胆汁|大肠|消化系统|牙齿|教师|客机|可乐|甲烷|残骸|图像|燧石|白眼果蝇|温度计|气压计|牙签|数学书|扁桃体|氨基酸|安山岩|胃酸|大葱|变压器|热水炉|狐狸|修女|水蒸气|拉尼亚凯亚超星系团|锯子|锤子|地壳|按钮|竹节虫|地核|蟒蛇|咖啡|铁锈|鳞片|尘土|铁块|药丸|纸箱|大肠|小肠|胰脏|土豆|寄生虫|导线|路由器|阿尔卑斯山|喜马拉雅山|核弹头|面包机|卢浮宫|时光机|锯子|台风|吸血鬼|学校|万里长城|热带风暴|沙尘暴|人工智能|床|皇帝|国王|老板|咸鱼|鱼|臭味|鲁迅|苏格拉底|孔子|柏拉图|孟子|牛顿|爱因斯坦|浓汤|上尉|洪秀全|嬴政|莫扎特|达芬奇|荆轲|贝多芬|频道|开关|水母|手指|汽车|残骸|石油|鸡蛋|辣椒|骨髓|猿猴|老奶奶|国王|富士山|游乐园|上帝|石头|尸体|蛇|排泄物|拇指|食指|中指|无名指|尾指|炸药|创口贴|厕所|老人|鲨鱼|播音室|陆地|电视机|宫殿|教皇|玉米|总督|脑神经|处理器|肾脏|孙权|朱自清|诸葛亮|关羽|刘备|张飞|莎士比亚|华盛顿|拿破仑|培根|安徒生|爱迪生|毕加索|朱元璋|刀|牛粪|曾国藩|李鸿章|康有为|梁启超|秦始皇|氨气|眼球|鼻涕|白痴|脸皮|植物细胞|线粒体|草地|果实|电话卡|铲子|猎人|树|花|草|参天大树|红茶|血液|象牙|树叶|树根|钉子|门"));

static auto Verb=(Word::Cre("/verb","击打|空袭|称霸|踏破|掀翻|冰封|闪击|上|席卷|袭击|偷袭|爆破|打开|关闭|碎裂|碎裂|占领|语言攻击|冷暴力|堵塞|杀掉|进入|推出|退出|删掉|治疗|加热|烧烤|思考|记得|忘掉|清洗|轰炸|关掉|启动|拿起|驾驶|敲打|殴打|拷打|搬进|抽出|拿走|抬起|建造|点燃|安装|删除|读取|按下|旋转|扭动|抱起|粘上|盯着|张开|切开|踢掉|肘击|摊开|抹除|抹掉|蹭蹭|翘起|扭向|捏住|探望|吐向|解刨|否定|拒绝|肯定|张开嘴巴试图吃掉|希望|期盼"));

static auto Vebi=(Word::Cre("/vebi","抽搐|走路|死掉|卡机|排泄|自爆|发癫|害怕|思考|生存|活着|呼吸|睡觉|起飞|发疯|大哭|狂笑|狂笑|扭曲|分解|结合|融化|萎缩|膨胀|跳舞|生锈|氧化|游泳|嗯嗯了|自裁|中风|倾家荡产|痉挛|流口水|爬行|大吼大叫|乱飞|喷气|排泄|崩溃|报错|发光|飞翔|解体|坍缩|通电|沸腾|自毁|生长|反弹|移动|升天|蠕动|潜水|跳舞|发病|变形|嘶吼|无差别攻击|搁浅|自燃|乱杀|腐化|摇动|行走|穿越时空|洗澡|吃饭|腐烂|破碎|旋转|窒息|抬头|偷听|破碎|爆裂|开怀大笑|咬人|呕吐|嬉戏|杀人|发出声音|钓鱼|飞来飞去|断裂|出车祸|喝酒|伸缩|发射核辐射|笑死|着火|排便|便秘|排出气体|发出笑声|死去|看电视|考试|上厕所"));

static auto Degree=(Word::Cre("/degree","十分|很|究极|非常|十分甚至九分"));

static auto Adv1=(Word::Cre("/adv1","忘记|原地|不断|突然|进一步|逐渐|悄悄|把屁股翘起来|站在这里|还没睡醒就|将会被你引导|其实一点也不想|可能会|会|可能不会|不会|一定会|一定一定会|一定不会|一定一定不会|也许会|也许不会|肯定会"));

static auto Adv2=(Word::Cre("/adv2","无奈地|失望地|愤怒地|开心地|用力地|绝望地|懊恼地|心不在焉地|头也不回地"));

static auto Prep=(Word::Cre("/prep","中|里面|外面|上面|下面|内部|身上"));

static auto Punc=(Word::Cre("/punc","。|，|！|。"));

#endif //废话生成器_WORD_HPP
